"""
============================
Author: 潘师傅
Time: 2022/7/29 17:43
Project: wxzy
Company: 无限主义
============================
"""
"""
客户端
    领券可以领多张？
    可以叠加使用？ 尝试取消再选择
    过期了还能使用？
        修改服务器时间
        修改数据库券的时间
    其他类型/店铺可以使用吗
    券的数量
    下单页面、支付页面的付款金额要正确
    使用优惠券后、包邮？
查看优惠券
    分类显示我的优惠券
        未使用
        已使用
        已过期
    排序
    点击优惠券会不会跳转到使用场景
服务端（后台管理系统）
    金额
        满50-10
        满100-20
    创建规则
        购物券
            生鲜
            服装
            电子产品
            全场通用
        店铺券 指定店铺、店铺内所有商品都可以使用
支付完成之后
    退款  优惠券不退，但是钱得退
    订单详情    使用优惠券下单，但是不支付，再去取消订单，优惠券没了

"""
