"""
============================
Author: 潘师傅
Time: 2022/7/29 17:44
Project: wxzy
Company: 无限主义
============================
"""

"""
功能测试：
主要关注水杯基本功能
1.1 水杯是否可以正常装水
1.2 水杯是否可以正常喝水
1.3 水杯是否有盖子，盖子是否可以正常盖住
1.4 水杯是否有保温功能，保温功能是否正常保温
1.5 水杯是否会漏水，盖住盖子拧紧后是否会漏水


界面测试：
主要关注水杯外观、颜色、设计等方面
2.1 外观是否完整
2.2 外观是否舒适
2.3 颜色搭配及使用是否让人感到舒适
2.2 杯子外观大小是否适中
2.3 杯子是否有图案，图案是否易磨损


易用性测试：
主要关注水杯使用是否方便
3.1 水杯喝水时否方便
3.2 水杯拿起放下是否方便，这里会衍生到水杯形状的测试
3.3 水杯装水是否方便
3.4 水杯携带是否方方便
3.5 水杯是否有防滑功能
3.6 水杯装有低温或者高温水时，是否会让手感到不适


性能测试：
4.1 水杯装满水时，是否会露出来
4.2 水杯最大使用次数
4.3 水杯的保温性是否达到要求
4.4 水杯的耐寒性是否达到要求
4.5 水杯的耐热性是否达到要求
4.6 水杯掉落时时，是否可以正常使用
4.7 水杯长时间放置时，是否会发生泄露


兼容性测试：
主要关注水杯是否可以装其他液体，如果汁、汽油、酒精等


可移植性测试：
主要关注水杯放置环境等
6.1 将水杯放在常温环境中，使用是否正常
6.2 将水杯放在零下的环境中，使用是否正常
6.3 将水杯放在高于正常温度的环境中，使用是否正常


安全性测试：
主要关注水杯外观和各种异常条件下是否释放有毒物质等
7.1 当水杯装满热水时，水杯是否会烫手
7.2 当水杯装上水后，是否会产生有毒物质
7.3 把水杯放在零下环境时，是否会产生有毒物质
7.4 把水杯放在高温环境时，是否会产生有毒物质

"""