"""
你先做一个简单的自我介绍
    我叫XXX，16年XX学校XX专业毕业，毕业至今从事测试工作到现在有X年了。X年中我带过2家公司，最近的一家公司是做互联网金融的。我负责包括接口测试，
    功能测试，界面测试，兼容性测试；另外也做过性能测试和自动化测试，平时也用很多测试工具，比如SVN，JMETER,POSTMAN,FIDDLER,PYCHARM等等，
    平时工作站我是一个比较细致的人，所以我觉得我很适合测试岗位，谢谢

你为什么从上一家公司离职
    上一家公司很好，走的适合老大也挽留我，但公司平时项目不多，工作比较清闲，感觉这样下去不行，我想年轻的时候多做一点事，多一些锻炼，所以才提出离职

你后面还有其他面试么
    我之前面试过几家，有一些公司已经给了offer，有些还在等进一步的消息。但是同通过这次的面试，我觉得贵公司的实力和文化，对我来说适合发展的平台，
    我的经历和技能又很符合公司的需求，所有希望公司能够考虑我

说说你的优缺点
    优点：我个人抗压能力还可以，向我们之前公司项目紧急情况下持续一个月加班到晚上10点；还有就是责任态度方面，上级交付给我的任务我都会主动汇报进度，
    且都按时按需完成
    缺点：我的记忆力不太好，所以平时我会弄很多的小标签或备忘录来提醒自己

你能接受996吗？
    我个人对加班是不排斥的，我们之前公司也经常加班，项目紧张的适合也会经常加到深夜。所以这方面我也是可以接受的。
    至于996制度，我可以尝试下（如果不能接受，可以直接拒绝）

谈谈你的职业规划
    0-1年：作为初中级的测试工程师，所以如果有幸进入贵公司工作的话，我会先熟悉公司的产品及业务，把本职的工作做好
    2-4年：往自动化测试发展，提升成为一位资深测试工程师
    5年以后：计划做测试开发

工作中遇到难题怎么办？
    有一次我们产品上线后出现了一个严重的bug，很久不能复现；后来我跟客户那边要了用户的所有配置和环境拓扑，花了3天时间终于找到复现的步骤。
    通过这件事，我认识到测试细致的重要性，要跟用户环境尽量保持一致；遇到难题不要慌张，沉着去解决。

公司只有我一个测试怎么办？
    公司如果只有我一个测试员，先判断领导是否有能力和魄力去实现一个公司的蜕变，再判断自己是否有能力和知识一起成长，如果有。那就不要退缩和放弃。
    当然，如果答案是否定的。那也不需要迟疑。可以跳槽选择一个更加合适自己的平台

怎么处理开发和测试之间的关系
    虽然开发和测试之间存在着天然的“敌对”关系，但是作为测试人员要树立好自己的定位，清楚和知道无论开发和测试，最终的目的都使项目高质量、高时效地完成。
    只有开发和测试并力合作才能完成好一个项目。

你还有什么想要问的吗？
    请问您担任的职位是？
    贵公司的规模是什么样的，有多少人
    我如果入职后做的项目处于什么样的地位？
    项目目前情况，发布了几个版本，以后的计划
    我如果入职的话，以后从事那一块的工作

"""